In [3]:
import pandas as pd
import sqlite3

def sql_i(instruction,data_b="data.db"):
    conn=sqlite3.connect(data_b)
    cur=conn.cursor()
    cur.execute(instruction)
    if "select" in instruction.lower() or "pragma" in instruction.lower():
        rows=cur.fetchall()
        conn.close()
        return(rows)
    else:
        conn.commit()  
        conn.close()

# Task B: ALTER using DROP COLUMN

In [4]:
sql_i("ALTER TABLE PETSALE DROP COLUMN PROFIT")
columns=sql_i("PRAGMA table_info('PETSALE')")
columns

OperationalError: no such column: "PROFIT"

In [5]:
columns=sql_i("PRAGMA table_info('PETSALE')")
columns

[(0, 'ID', 'INTEGER', 1, None, 0),
 (1, 'PET', 'TEXT', 0, None, 0),
 (2, 'SALEPRICE', 'REAL', 0, None, 0),
 (3, 'SALEDATE', 'DATE', 0, None, 0),
 (4, 'QUANTITY', 'INTEGER', 0, None, 0)]

In [6]:
head=[]
for name in columns:
    head.append(name[1])
head

['ID', 'PET', 'SALEPRICE', 'SALEDATE', 'QUANTITY']

In [7]:
petsale=sql_i("SELECT * FROM PETSALE")
petsale=pd.DataFrame(petsale,columns=head)
petsale

   ID       PET  SALEPRICE    SALEDATE  QUANTITY
0   1       Cat     450.09  2018-05-29         9
1   2       Dog     666.66  2018-06-01         3
2   3    Parrot      50.00  2018-06-04         2
3   4   Hamster      60.60  2018-06-11         6
4   5  Goldfish      48.48  2018-06-14        24

# Task C: ALTER using ALTER COLUMN

In [6]:
sql_i("ALTER TABLE PETSALE ALTER COLUMN ID SET DATA TYPE TEXT") #can't used with sqlite

OperationalError: near "ALTER": syntax error

# Task D: ALTER using RENAME COLUMN

In [8]:
sql_i("ALTER TABLE PETSALE RENAME COLUMN PET TO ANIMAL")

In [9]:
columns=sql_i("PRAGMA table_info('PETSALE')")
columns

[(0, 'ID', 'INTEGER', 1, None, 0),
 (1, 'ANIMAL', 'TEXT', 0, None, 0),
 (2, 'SALEPRICE', 'REAL', 0, None, 0),
 (3, 'SALEDATE', 'DATE', 0, None, 0),
 (4, 'QUANTITY', 'INTEGER', 0, None, 0)]

In [10]:
head=[]
for name in columns:
    head.append(name[1])
head

['ID', 'ANIMAL', 'SALEPRICE', 'SALEDATE', 'QUANTITY']

In [11]:
petsale=sql_i("SELECT * FROM PETSALE")
petsale=pd.DataFrame(petsale,columns=head)
petsale

   ID    ANIMAL  SALEPRICE    SALEDATE  QUANTITY
0   1       Cat     450.09  2018-05-29         9
1   2       Dog     666.66  2018-06-01         3
2   3    Parrot      50.00  2018-06-04         2
3   4   Hamster      60.60  2018-06-11         6
4   5  Goldfish      48.48  2018-06-14        24

# Exercise 3: TRUNCATE

In [12]:
sql_i("TRUNCATE TABLE PET IMMEDIATE")

OperationalError: near "TRUNCATE": syntax error

# Exercise 4: DROP

In [13]:
sql_i("DROP TABLE PET")

In [14]:
output2=sql_i("SELECT * FROM PET")
print(output2)

OperationalError: no such table: PET